nc: 3  # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.00, 1.50, 1024]
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, HierarchicalRepNet, [128, 0.5]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, HierarchicalRepNet, [256, 0.5]]
  - [-1, 1, Conv, [384, 3, 2]]  # 5-P4/16
  - [-1, 1, HierarchicalRepNet, [384, 1.0]]
  - [-1, 1, Conv, [384, 3, 2]]  # 7-P5/32
  - [-1, 3, HierarchicalRepNet, [384, 1.0]]

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 9
  - [-1, 1, AIFI_EDFFN, [1024, 8]] # 10
  - [-1, 1, Conv, [256, 1, 1]]  # 11

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 12
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 13
  - [[-2, -1], 1, EfficientBalanceFusionModuleV1, [1]] # 14
  - [-1, 3, Converse2DC3, [256, 0.5]]  # 15
  - [-1, 1, Conv, [256, 1, 1]]   # 16

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17
  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 18
  - [[-2, -1], 1, EfficientBalanceFusionModuleV1, [1]]  # 19
  - [-1, 3, Converse2DC3, [256, 0.5]]    # 20

  - [-1, 1, Conv, [256, 3, 2]]   # 21
  - [[-1, 16], 1, EfficientBalanceFusionModuleV1, [1]]  # 22
  - [-1, 3, Converse2DC3, [256, 0.5]]    # 23

  - [-1, 1, Conv, [256, 3, 2]]   # 24
  - [[-1, 11], 1, EfficientBalanceFusionModuleV1, [1]]  # 25
  - [-1, 3, Converse2DC3, [256, 0.5]]    # 26

  - [[20, 23, 26], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]